<?php

$lang['Id'] 			= "ID Планеты";
$lang['cle'] 			= "Лёгкий истребитель"; 
$lang['clourd'] 			= "Тяжёлый истребитель";
$lang['pt'] 			= "Малый транспорт";
$lang['gt'] 			= "Большой транспорт";
$lang['cruise']			= "Крейсер";
$lang['vb'] 			= "Линкор";
$lang['colo'] 			= "Колонизатор";
$lang['rc'] 			= "Переработчик";
$lang['spy'] 			= "Шпионский зонд";
$lang['bomb'] 			= "Бомбардировщик";
$lang['solar'] 			= "Солнечный спутник";
$lang['des'] 			= "Уничтожитель";
$lang['rip'] 			= "Звезда смерти";
$lang['traq'] 			= "Линейный крейсер";

?>