export default {
	'FLEET_MISSION': {
		1: 'Атаковать',
		2: 'Объединить',
		3: 'Транспорт',
		4: 'Оставить',
		5: 'Удерживать',
		6: 'Шпионаж',
		7: 'Колонизировать',
		8: 'Переработать',
		9: 'Уничтожить',
		10: 'Создать базу',
		15: 'Экспедиция',
		20: 'Межпланетная атака'
	},

	'PLANET_TYPE': {
		1: 'Планета',
		2: 'Поле обломков',
		3: 'Луна',
		5: 'Военная база'
	},

	'RESOURCES': {
		'metal': 'Металл',
		'crystal': 'Кристалл',
		'deuterium': 'Дейтерий',
		'energy': 'Энергия'
	},

	'MESSAGE_TYPES': {
		0: 'Шпионские отчёты',
		1: 'Сообщения от игроков',
		2: 'Сообщения альянса',
		3: 'Военные отчёты',
		4: 'Системные сообщения',
		5: 'Доставка флота',
		15: 'Отчёты экспедиций',
		99: 'Сообщения очереди построек',
		100: 'Все сообщения',
		101: 'Исходящие'
	},

	'MESSAGE_TYPES_BACKGROUNDS': {
		0: '#663366',
		1: '#336666',
		2: '#000099',
		3: '#061B2D',
		4: '#999999',
		5: '#999999',
		15: '#999999',
		99: '#999999',
		100: '#999999'
	},

	'RACES': {
		1: 'Конфедерация',
		2: 'Бионики',
		3: 'Сайлоны',
		4: 'Древние'
	},

	'TECH': {
		1: 'Рудник металла',
		2: 'Рудник кристалла',
		3: 'Синтезатор дейтерия',
		4: 'Солнечная батарея',
		12: 'Термоядерный реактор',
		14: 'Фабрика роботов',
		15: 'Фабрика нанитов',
		21: 'Верфь',
		22: 'Склад металла',
		23: 'Склад кристалла',
		24: 'Емкость дейтерия',
		31: 'Лаборатория',
		33: 'Терраформер',
		34: 'Склад альянса',
		41: 'Лунная база',
		42: 'Сенсорная фаланга',
		43: 'Межгалактические врата',
		44: 'Ракетная шахта',

		106: 'Шпионаж',
		108: 'Компьютерная технология',
		109: 'Оружейная технология',
		110: 'Щитовая технология',
		111: 'Броня космических кораблей',
		113: 'Энергетическая технология',
		114: 'Гиперпространственная технология',
		115: 'Ракетный двигатель',
		117: 'Импульсный двигатель',
		118: 'Гиперпространственный двигатель',
		120: 'Лазерная технология',
		121: 'Ионная технология',
		122: 'Плазменная технология',
		123: 'М.И.С.',
		124: 'Экспедиционная технология',
		150: 'Технология колонизации',
		161: 'Военная база',
		199: 'Гравитационная технология',

		202: 'Малый транспорт',
		203: 'Большой транспорт',
		204: 'Лёгкий истребитель',
		205: 'Тяжёлый истребитель',
		206: 'Крейсер',
		207: 'Линкор',
		208: 'Колонизатор',
		209: 'Переработчик',
		210: 'Шпионский зонд',
		211: 'Бомбардировщик',
		212: 'Солнечный спутник',
		213: 'Уничтожитель',
		214: 'Звезда смерти',
		215: 'Линейный крейсер',
		216: 'Передвижная база',

		220: 'Корвет',
		221: 'Перехватчик',
		222: 'Дредноут',
		223: 'Корсар',

		401: 'Ракетная установка',
		402: 'Легкий лазер',
		403: 'Тяжёлый лазер',
		404: 'Пушка Гаусса',
		405: 'Ионное орудие',
		406: 'Плазменное орудие',
		407: 'Малый щитовой купол',
		408: 'Большой щитовой купол',
		502: 'Ракета-перехватчик',
		503: 'Межпланетная ракета',

		601: 'Геолог',
		602: 'Адмирал',
		603: 'Инженер',
		604: 'Технократ',
		605: 'Архитектор',
		606: 'Метафизик',
		607: 'Наёмник',

		701: 'Конфедерация',
		702: 'Бионики',
		703: 'Сайлоны',
		704: 'Древние',
	},

	'alliance': {
		'diplomacy_status': {
			0: "Нейтральное",
			1: "Перемирие",
			2: "Мир",
			3: "Война"
		}
	},
	'colors': {
		0: ['white', ''],
		1: ['white', 'Бeлый'],
		2: ['navy', 'Teмнocиний'],
		3: ['blue', ''],
		4: ['#7397E1', 'Гoлyбoй'],
		5: ['#009898', 'Mopcкoй вoлны'],
		6: ['red', 'Kpacный'],
		7: ['fuchsia', 'Poзoвый'],
		8: ['gray', 'Cepый'],
		9: ['lime', 'Зeлeный'],
		10: ['maroon', 'Teмнoкpacный'],
		11: ['orange', 'Opaнжeвый'],
		12: ['сhocolate', ''],
		13: ['darkkhaki', 'Teмный xaки']
	}
}