
var Lang = [];

Lang['ru'] =
{
	'FLEET_MISSION': {
		1: 'Атаковать',
		2: 'Объединить',
		3: 'Транспорт',
		4: 'Оставить',
		5: 'Удерживать',
		6: 'Шпионаж',
		7: 'Колонизировать',
		8: 'Переработать',
		9: 'Уничтожить',
		10: 'Создать базу',
		15: 'Экспедиция',
		20: 'Межпланетная атака'
	},

	'PLANET_TYPE': {
		1: 'Планета',
		2: 'Поле обломков',
		3: 'Луна',
		5: 'Военная база'
	},

	'TECH': {
		202: "Малый транспорт",
		203: "Большой транспорт",
		204: "Лёгкий истребитель",
		205: "Тяжёлый истребитель",
		206: "Крейсер",
		207: "Линкор",
		208: "Колонизатор",
		209: "Переработчик",
		210: "Шпионский зонд",
		211: "Бомбардировщик",
		212: "Солнечный спутник",
		213: "Уничтожитель",
		214: "Звезда смерти",
		215: "Линейный крейсер",
		216: "Передвижная база",
	}
}