<?php

$lang['NoPoints']     = "У вас недостаточно кредитов!";
$lang['OffiRecrute']  = "Офицер был завербован!";
$lang['off_points']   = "Доступно кредитов : ";

$lang['Officier']     = "Офицер";

$lang['ttle'][601] = "Геолог";
$lang['ttle'][602] = "Адмирал";
$lang['ttle'][603] = "Инженер";
$lang['ttle'][604] = "Технократ";
$lang['ttle'][605] = "Архитектор";
$lang['ttle'][606] = "Метафизик";
$lang['ttle'][607] = "Наёмник";

$lang['Desc'][601] = "Геолог - это признанный эксперт в астроминералогии и кристаллографии. Он со своей командой металлургов и химиков поддерживает межпланетные правительства при разработке новых источников ресурсов и оптимизации их очистки.";
$lang['Desc'][602] = "Адмирал - это испытанный войной ветеран и гениальный стратег. Даже в самых горячих боях он не теряет обзора и поддерживает контакт с подчинёнными ему адмиралами. Мудрый правитель может полностью положиться на него в бою и тем самым использовать для боя больше кораблей.";
$lang['Desc'][603] = "Инженер - это специалист по управлению энергией. В мирное время он повышает уровень энергетических сетей на колониях. В случае нападения он снабжает энергетические системы планетарных защит и предотвращает перегрузки, что ведёт к значительно меньшей степени потерь в бою.";
$lang['Desc'][604] = "Гильдия технократов - это гениальные учёные, и их всегда можно найти там, где заканчивается грань технически возможного. Их код никогда не сможет разгадать ни один нормальный человек, и одним своим присутствием они вдохновляют учёных империи.";
$lang['Desc'][605] = "Архитектор - это незаменимый специалист в любом строительстве. Благодаря исследованиям и экспериментам, связанным с проектным решением, авторскому надзору за строительством и научному подходу, позволяет ускорить строительство и увеличить КПД строителей.";
$lang['Desc'][606] = "Метафизик - это высококласный специалист в оптимизации топливной системы кораблей. Будучи нанятым на службу, он сократит ваши расходы дейтерия на перелеты.";
$lang['Desc'][607] = "Наёмник - высококласный специалист в военном деле. Нанятый к вам на службу, он помогает увеличить эффективность вашего вооружения.";

$lang['power'][601] = array
(
	'+25% доход от шахт',
	'+25% вместимость хранилищ'
);

$lang['power'][602] = array
(
	'+2 макс. кол-во флотов',
	'+10% шанс возникновения луны',
	'+25% к скорости кораблей',
	'-10% затраты на строительство кораблей'
);

$lang['power'][603] = array
(
	'+15% выработка энергии',
	'-10% затраты на строительство обороны',
	'-30% потери при обороне',
	'-50% шанс взрыва ЗС'
);

$lang['power'][604] = array
(
	'+2 к уровню шпионажа',
	'-25% времени на исследования'
);

$lang['power'][605] = array
(
	'+2 к очереди построек',
	'-25% времени на постройку'
);

$lang['power'][606] = array
(
	'-10% потребление дейтерия в полёте'
);

$lang['power'][607] = array
(
	'+10% Вооружение',
	'+10% Щиты',
	'+10% Броня'
);