<?php

$lang['who'] = array(
	'players' => 'Игрок',
	'alliance' => 'Альянс',
	'race' => 'Фракция'
);

$lang['type_players'] = array(
	1 => 'Очкам',
	2 => 'Флоту',
	5 => 'Постройкам',
	3 => 'Исследованиям',
	4 => 'Обороне',
	6 => 'Мирному уровню',
	7 => 'Боевому уровню',
);

$lang['type_alliance'] = array(
	1 => 'Очкам',
	2 => 'Флоту',
	5 => 'Постройкам',
	3 => 'Исследованиям',
	4 => 'Обороне',
);

$lang['type_race'] = array(
	1 => 'Очкам',
	2 => 'Флоту',
	5 => 'Постройкам',
	3 => 'Исследованиям',
	4 => 'Обороне',
);