<?php

return [
	'registry' => 'Регистрация',
	'form' => 'Форма ввода данных',
	'Register' => 'XNova Регистрация',
	'Multiverse' => 'XNova',
	'E-Mail' => 'E-Mail',
	'signup' => ' Зарегистрировать ',

	'mail_welcome' => 'Спасибо за регистрацию в нашей игре!!!
Для входа нажмите сюда: ({gameurl})',

	'mail_title' => 'Регистрация',
	'thanksforregistry' => 'Спасибо за регистрацию!! На данный почтовый адрес была послана информация о регистрации :)',

	'error_mail' => 'Некорректный адрес E-mail!<br />',
	'error_mailsend' => 'Невозможно отправить письмо!!',
	'reg_welldone' => 'Активация успешна!!!',
];