<?php

// ----------------------------------------------------------------------------------------------------------

$lang['nfo_page_title']  = "Информация";
$lang['nfo_title_head']  = "Информация";
$lang['nfo_name']        = "Имя";
$lang['nfo_destroy']     = "Снести";
$lang['nfo_level']       = "Уровень";
$lang['nfo_range']       = "Дальность действия сенсоров";
$lang['nfo_used_energy'] = "Потребление энергии";
$lang['nfo_used_deuter'] = "Потребление дейтерия";
$lang['nfo_prod_energy'] = "Производство энергии";
$lang['nfo_difference']  = "Разница";
$lang['nfo_prod_p_hour'] = "Факор продукции";
$lang['nfo_needed']      = "Требуется";
$lang['nfo_dest_durati'] = "Время сноса";
$lang['nfo_rf_again']    = "Одним залпом поражает";
$lang['nfo_rf_from']     = "одним залпом поражает";

// ----------------------------------------------------------------------------------------------------------

$lang['gate_start_moon'] = "Исходная точка отправления";
$lang['gate_dest_moon']  = "Пункт назначения";
$lang['gate_use_gate']   = "Использовать Межгалактические врата";
$lang['gate_ship_sel']   = "Количество кораблей";
$lang['gate_ship_dispo'] = "В распоряжении";
$lang['gate_jump_btn']   = "Погрузка";
$lang['gate_jump_done']  = "Погрузка завершенна, теперь скачок возможен: ";
$lang['gate_wait_dest']  = "Энергия ворот цели еще не соединилась с вашей: ";
$lang['gate_no_dest_g']  = "На эту планету не ведут ворота!";
$lang['gate_wait_star']  = "Энергия ворот израсходована, время до перезарядки ";
$lang['gate_wait_data']  = "Ошибка, ошибочные данные!";

// ----------------------------------------------------------------------------------------------------------

return $lang;