<?php

return [
	'battle_report_not_found' => 'Боевой доклад не найден',
	'delete_failed' => 'Ошибка удаления.',
	'title_required' => 'Введите название для боевого отчёта',
	'report_id_required' => 'Введите ID боевого отчёта',
	'invalid_key' => 'Неправильный ключ',
	'report_not_found' => 'Боевой отчёт не найден в базе',
	'save_failed' => 'Произошла ошибка при сохранении боевого отчета',
	'saved' => 'Боевой отчёт успешно сохранён',
	'log_not_found' => 'Запрашиваемого лога не существует в базе данных',
	'fleet_contact_lost' => 'Контакт с флотом потерян.<br>(Флот был уничтожен в первой волне атаки.)',
	'not_available_yet' => 'Данный лог боя пока недоступен для просмотра!',
	'processing_failed' => 'Ошибка обработки боевого отчета',
	'invalid_signature' => 'Недействительная подпись',
	'report_missing_or_deleted' => 'Данный боевой отчет не найден или удалён',
	'view_forbidden' => 'Вы не можете просматривать этот боевой доклад',
	'own_fleet_contact_lost' => 'Контакт с вашим флотом потерян<br>(Ваш флот был уничтожен в первой волне атаки)',
	'report_id_label' => 'ID боевого доклада:',
];
