<?php

$lang['alliance']   = 'Альянс';
$lang['title']      = "Почтовый ящик";
$lang['head_type']  = "Категории";
$lang['head_count'] = "Непрочитанные";
$lang['head_total'] = "Всего";
$lang['type'][1]    = "Шпионские отчёты";
$lang['type'][2]    = "Сообщения от игроков";
$lang['type'][3]    = "Сообщения альянса";
$lang['type'][4]    = "Военные отчёты";
$lang['type'][5]    = "Системные сообщения";
$lang['type'][6]    = "Доставка флота";
$lang['type'][15]   = "Отчёты экспедиций";
$lang['type'][99]   = "Сообщения очереди построек";
$lang['type'][100]  = "Все сообщения";
$lang['type'][101]  = "Исходящие";

$lang['mess_pagetitle']      = "Отправка сообщения";
$lang['mess_error']          = "Ошибка";
$lang['mess_no_ownerid']     = "Обнаружена ошибка, пожалуйста сообщите о администратору!";
$lang['mess_no_ownerpl']     = "Обнаружена ошибка, пожалуйста сообщите о администратору ";
$lang['mess_no_owner']       = "Такого игрока несуществует.";
$lang['mess_recipient']      = "Получатель";
$lang['mess_message']        = "Сообщение";
$lang['mess_characters']     = "Знаков";
$lang['mess_subject']        = "Тема";
$lang['mess_envoyer']        = " Отправить ";
$lang['mess_no_subject']     = "Тема сообщения";
$lang['mess_similar']     	 = "Вы посылаете слишком похожие сообщения, подождите пару минут перед отправкой";
$lang['mess_block']     	 = "Вам была ограничена отправка сообщений, подождите некоторое время и попробуйте еще раз";
$lang['mess_limit']     	 = "Вы можете отсылать не более 1 сообщения в минуту. Ограничение будет снято спустя сутки после регистрации.";
$lang['mess_no_text']        = "Будем отправлять пустое сообщение?";
$lang['mess_sended']         = "Сообщение отправлено!";
$lang['mess_partialreport']  = "Разведданные показывать частично";
$lang['mess_deleteunmarked'] = "Удалить неотмеченные сообщения";
$lang['mess_deletemarked']   = "Удалить отмеченные сообщения";
$lang['mess_deleteall']      = "Удалить все сообщения";
$lang['mess_its_ok']         = " ок ";
$lang['mess_from']           = "От";
$lang['mess_action']         = "Действие";
$lang['mess_date']           = "Дата";
$lang['mess_answer']         = "Ответить";
$lang['mess_answer_prefix']  = "Re:";

$lang['mess_background'] = array
(
	0 => '#663366',
	1 => '#336666',
	2 => '#000099',
	3 => '#061B2D',
	4 => '#999999',
	5 => '#999999',
	15 => '#999999',
	99 => '#999999',
	100 => '#999999'
);

return $lang;