<?php

$lang['news'] = array(

'<font color="lime">4.1</font>' => 'Made by AlexPro
FIX: Исправление ошибок
',

'<font color="lime">4.0</font>' => 'Made by AlexPro
CORE: Переписан интерфейс на Vue.js
CORE: Переезд на публичный репозиторий <a href="https://github.com/alexprowars/xnova-game" target="_blank">GitHub</a>
',

'<font color="lime">3.0</font>' => 'Made by AlexPro
CORE: Переезд на MVC фреймворк Phalcon
',

'<font color="lime">2.6</font>' => 'Made by AlexPro
MOD: Мобильная версия
FIX: Оптимизация потребления интернет-траффика
FIX: Оптимизация ядра игры
FIX: много :)
',

'<font color="lime">2.5</font>' => 'Made by AlexPro
CORE: Update
MOD: Графический вид построек
MOD: Новое ядро расчёта битв
MOD: Оптимизация интерфейса под разные экраны монитора
DEL: Аккумуляторная станция
FIX: много
',

'<font color="lime">2.2</font>' => 'Made by AlexPro
CORE: Update
',

'<font color="lime">2.1</font>' => 'Made by AlexPro
CORE: Патчи ядра
MOD: Калькуляторы
MOD: Показ неактивных технологий в меню "Оборона", "Верфь", "Наука", "Постройки"
MOD: Юзербары
MOD: Смена изображения у планеты
FIX: Ограничение миссии "Транспорт" для неактивных игроков и игроков с совпадениями по IP
FIX: Защита от парсера галактики
FIX: Отправка переработчиков на ПО через галактику
FIX: Пересчет ресурсов на планете для миссий "Транспорт" и "Оставить"
FIX: Отмена обработки боя при удалении планеты
FIX: обучение: Не нужно вступать в альянс с 3 игроками, достаточно вступить или создать свой альянс
FIX: HTML5 History API Chrome Bug
FIX: Модуль цензуры в чате и личных сообщениях
FIX: Сохранение выбранных параметров в личных сообщениях
FIX: Переработка модуля "Статистика"
FIX: Новый алгоритм размещения планет при регистрации
FIX: Переработка модуля "Обзор"
FIX: Ошибка при бое на удержании
FIX: Формула добычи энергии спутниками
FIX: Кол-во шпионов из меню галактики
FIX: Тонна фиксов ajax навигации
+ еще много фиксов, которые я не помню
+ тонна мелких правок шаблонов и дизайна
',

'<font color="lime">2.0</font>' => 'Made by AlexPro
CORE: Новое ядро игры
FIX: Новый обработчик флотов
FIX: Оптимизация шаблонов игры
',

'<font color="lime">1.5</font>' => 'Made by AlexPro
GLOBAL: Глобальное обновление ядра игры
MOD: Лычки в информации о игроке
MOD: Новая страница входа
MOD: BB коды для формирования таблиц
MOD: Конвертер шпионского отчета в формат BB кодов
MOD: Часовые пояса
MOD: Графическое дерево технологий (beta)
MOD: Офицера в отчете о шпионаже
MOD: Загрузка аватарок
MOD: Удаление из очереди построек любых позиций
FIX: Сортировка в списке рефералов по убыванию даты регистрации
FIX: Ошибка переключения планет на военной базе
FIX: Оптимизация миссии "Шпионаж"
FIX: Координаты флота, находящегося на удержании
FIX: Перерасчет времени построек после строительства некоторых зданий
FIX: Перерасчет добычи ресурсов после строительства некоторых зданий
FIX: Ошибка при сохранении координат в заметках
HOT-FIX: Ошибка накопления ресурсов в отпуске
',

'<font color="lime">1.4</font>' => 'Made by AlexPro
MOD: Статистика фракций
MOD: Значек фракции при поиске
MOD: Отправка сообщений с помощью клавиш Ctrl+Enter
MOD: Описание истории фракций (mod by Zeliboba)
MOD: Отправка переработчиков через ajax в меню "Обзор" и "Галактика"
MOD: Отправка шпионских зондов из меню "Галактика"
MOD: Время заряда/разряда батареи
MOD: Отображение текущего строительства в империи
MOD: Переработка чата
MOD: Отображение летящих флотов во вкладке "Империя"
MOD: Вывод в шпионском отчете информации о прокачках кораблей
MOD: Вывод информации о приземлившемся флоте в миссии "Оставить"
MOD: Загрузка в симулятор информации об атакующем флоте из меню "Обзор"
MOD: BB-код [mp3][/mp3]
FIX: Растягивание информации о игроке изза описания
FIX: Растягивание чата альянса изза картинок
FIX: Доступ в админ-панель
FIX: Ошибка в экспедиции
FIX: Ошибка бонуса фракции "Бионики"
FIX: Ошибка бонуса фракции "Сайлоны"
FIX: Удаление ассоциации флота при отзыве головного флота
FIX: Непроходимость обучения при отправке флота из галактики
FIX: Невидимые шпионы
FIX: Таймаут на просмотр боевых докладов из зала славы
FIX: Фракции в списках членов альянса
FIX: Отображение игры в браузерах IE ;)
FIX: Забаненые игроки лишаются защиты новичков
FIX: Автовход в игру работает месяц вместо недели
FIX: Внутренние оптимизации ядра игры
',

'<font color="lime">1.3</font>' => 'Made by AlexPro
- MOD: 4 Фракции
- MOD: Бонусы от фракций
- MOD: 4 новых вида кораблей
- MOD: Новый движок ракетной атаки
- MOD: Выбор планет в галактике
- MOD: Отображение союзных флотов в обзоре
- MOD: Отображение информации о вместимости храниищ
- MOD: Отображение статистики без захода в игру
- MOD: Отображение информации об альянсах без захода в игру
- MOD: Показ исследований в меню "Обзор"
- MOD: Размещение текстовой информации о игроке
- FIX: Фаланга
- FIX: Восстановление пароля
- FIX: Пропажа поля обломков после образования лун
- FIX: Обновление расчетов в меню Сырьё
- FIX: Снижение стоимости установки аватара
- FIX: Вычисление энергии при уменьшенном факторе продукции
',

'<font color="lime">1.2</font>' => 'Made by AlexPro
- MOD: Высадка флота на новую планету при колонизации
- MOD: IFrame приложение для соц сети ВКонтакте
- MOD: Сообщения альянс чата с любой страниц
- MOD: Друзья Вконтакте
- MOD: Старая страница входа
- MOD: Сортировка по типу планет
- MOD: Общая очередь построек в обзоре
- MOD: BBCodes
- MOD: Приветствие при подаче заявки в альянс
- MOD: Правки интерфейса
- MOD: Чат альянса
- MOD: Ежедневный бонус для игроков ВКонтакте
- MOD: Задержка появления боев в зале славы
- MOD: Выделение самого последнего боя в зале славы
- MOD: Фабрика
- MOD: Разбивка на группы флотов при бое
- MOD: Смена ника доступна раз в сутки
- MOD: Смена E-mail адреса
- FIX: % щитов
- FIX: Описание технологий
- FIX: Отказ от рекордов
- FIX: Посадка флота на планету
- FIX: Броня корабля в описании
- FIX: Прокачка кораблей
- FIX: Щиты
- FIX: Атака
- FIX: Ошибки отображения боевого отчета0
- FIX: Сортировка планет в обзоре
- FIX: Ошибка отправки переработчиков через меню "Обзор"
- FIX: Колонизатору необходима "Технология колонизации" 1 уровня
- FIX: Автоочистка чата альянса
- FIX: Отображение % щитов в логе боя
',

'<font color="lime">1.1</font>' => 'Made by AlexPro
- MOD: Расширение административной панели
- MOD: Статистика по обороне
- MOD: Меню Ссылки
- MOD: 2pay оплата
- MOD: Личное дело игрока
- MOD: Изменение интерфейса игры
- MOD: Симулятор сноса лун
- MOD: Офицеры доступны без обучения
- MOD: Отказ от участия в рекордах
- FIX: Языковые правки
- FIX: Отзыв флота при экспедиции
- FIX: Ошибки при выборе миссии Экспедиция
- FIX: Ошибка в миссии Экспедиция + правка очереди флотов
- FIX: Рекорды при обновлении
- FIX: Колонизация через галактику
- FIX: Вместимость транспортников при бое
- FIX: Бой при обнаружении шпионских зондов не заносится в статистику
- FIX: Отправка пустого сообщения в али-чат
- FIX: Бан-лист при блокировке
- FIX: Обновление списков чистки логов
- FIX: Удаление из бана при разбане
- FIX: Отображение получателя в исходящих сообщениях
- FIX: Максимальный промышленный и военный уровень
- FIX: Описание технологий вооружения, щитов и брони
- FIX: Округление распределения флота по группам
- FIX: В логе боя отображаются только положительные потери
- FIX: Округления в логе боя
- FIX: Изменение силы скорострела ЛИ против ЗС
- FIX: Ширина картинок в описании альянса
- FIX: Чит в обучении
- FIX: Балансировка наград обучения
- FIX: Отображение пустого зала славы
- FIX: Реферальная программа
- FIX: Переделка механизма дипломатии альянса
- FIX: Правки меню Сырьё
- FIX: Правки меню Статистика
- FIX: Кирилица в чате
- FIX: [Некоторая информация об исправлениях потеряна]
',

'<font color="lime">1.0</font>' => 'Made by AlexPro
- MOD: Переход к MySQLi
- MOD: Новый алгоритм расчета боёв
- MOD: Уровни кораблей
- MOD: Информация о бонусах исследований
- MOD: Новый вид обзора
- MOD: Цветной список планет
- MOD: Разделение ресурсов между участниками САБ
- MOD: Просмотр сообщении о битве и боевого доклада всеми участниками САБ
- MOD: Влияние технологий на расчет боя
- MOD: Система генерации страницы
- MOD: Изменение стиля страницы
- MOD: Опция отображения страницы на весь экран
- MOD: Время экспедиции зависит от уровня технологии
- MOD: Добавления функционала в меню строительстав флота и обороны
- MOD: Полный анализ исходного кода игры, удаление хлама и мертвого кода
- MOD: Расширенное логирование
- MOD: Новая система хранения боевых отчетов
- MOD: Скрытие лишних игроков в статистике
- MOD: Система обучения
- MOD: Глобальная включение/отключение производства
- MOD: Реорганизация кода альянсов
- MOD: Подсветка лун-фантомов
- MOD: Новый мезанизм покупки ресурсов
- MOD: Оптимизированный просмотр галактики
- MOD: Зал славы
- MOD: Изменен офицер Метафизик
- MOD: XNovaSIM 0.5
- MOD: Языковые правки
- FIX: [В описание всё не входит]
- DEL: [В описание не входит]
',

'<font color="lime">0.7 beta 2</font>' => 'Made by AlexPro
- FIX: Атака ракетами в РО
- FIX: Отображение межпланетной атаки в обзоре
- FIX: Ошибка ухода в РО
- FIX: Удержание у друзей
- FIX: CRC при отправке флота
- ADD: Переделка механизма авторизации
- DEL: API
- FIX (10.10.10): Строительство ракет сверх лимита
',

'<font color="lime">0.7 beta 1</font>' => 'Made by AlexPro
- MOD: Новое оформление
- MOD: Новый механизм взаимодействия с игрой
- MOD: Безопасные COOKIE
- FIX: Оптимизация вызова базовых функций игры
- DEL: Фреймова модель
ADD 19.01.2010
- FIX: Актуальная информация в меню "Империя"
',

'<font color="lime">0.6 beta 1</font>' => 'Made by AlexPro
- MOD: Антибашинг
- FIX: Присвоение ранга при вступлении в альянс
- FIX: Миссия "Уничтожить"
- FIX: Ошибки с очередью построек
- FIX: Ошибки с торговцем
- FIX: Передача альянса
- FIX: Фаланга не видит флот с луны
- FIX: Симулятор
- FIX: Броня кораблей
- FIX: Дипломатия
ADD 10.09.2009:
- ADD: Автоплатежи
- ADD: Аватары
- FIX: Виртуальные запросы в дипломатии
- FIX: Кривое отображение левого фрейма при РО и удалении
ADD 23.09.2009:
- FIX: Удерживаемый флот виден в шпионском докладе
- FIX: Удерживаемый флот остаётся защищать планету после атаки
ADD 28.12.2009:
- FIX: Луны без планет
',

'<font color="lime">0.5 beta 4</font>' => 'Made by AlexPro
- MOD: Антикликер
- MOD: Вкладка "Исходящие" в сообщениях
- MOD: Кнопка шпионажа, информация об игроке и добавить в закладки в галактике
- MOD: Дипломатия альянсов
- MOD: Торговец
- FIX: Улучшена защита от клонирования
- FIX: Ресурсы при сносе зданий
- FIX: САБ на военные базы
- FIX: Сбор обломков у военных баз
- FIX: Поля у аккумуляторных станций
- FIX: Много мелких фиксов и оптимизаций
- FIX: Переботка меню ссылок на планеты
- DEL: Убрано множество настроек за ненадобностью
ADD 12.07.2009:
- MOD: В информацию о кораблях добавлен тип двигателя
- MOD: При переходе из галактики в статистику по игроку его ник подсвечивается
- FIX: Переходы на информацию об альянсе
- FIX: Шпионские зонды не могут перевозить ресурсы
- FIX: Шпионские зонды можно посылать только с миссией Шпионаж
- FIX: В статистике альянсов ваш альянс подсвечивается
- FIX: При исключении из альянса счётчик альянс чата обнуляется
- FIX: Если нет прав на чтение альянс чата, счётчик сообщений обнуляется
- FIX: Фаланга как и положено потребляет 5000 дейтерия
- FIX: Нельзя вводить пустое имя
- FIX: Исправления в списке членов альянса
',

'<font color="lime">0.5 beta 3</font>' => 'Made by AlexPro
- MOD: XNova SIM 0.3 beta (с САБ)
- MOD: Меню "Информация о игроке"
- FIX: Начисление рейдерского опыта и очков
- FIX: Ошибка прикрепления флота к совместной атаке
- FIX: Подсчёт потерь обороны
- FIX: Оптимизация просмотра галактики
',

'<font color="lime">0.5 beta 2</font>' => 'Made by AlexPro
- MOD: Новая реферальная программа
- FIX: Отправка переработчиков с обзора
- FIX: Учёт технологии Проектирование кораблей
- FIX: Возврат к старому боевому движку
- FIX: Вместимость транспортов при атаке
- FIX: Описание Гравитационной технологии
- FIX: Чат альянса
- FIX: Учёт энергетической технологии в Термоядерной электростанции
',


'<font color="lime">0.5 beta 1</font>' => 'Made by AlexPro
- MOD: Платные услуги
- MOD: Строение: Аккумуляторная станция
- MOD: Ресурс: Батарея
- MOD: Ресурс: Кредиты
- MOD: Переделано меню сообщений
- MOD: Посылка ракет с дейтом из склада альянса
- MOD: Совместная атака
- MOD: Новая опция для больших мониторов
- MOD: Новый вид меню Империя
- MOD: Новый вид меню Обзор
- MOD: Новая система активации пожертвований (pin коды)
- MOD: Новая технология Проектирование кораблей
- FIX: Чит фиксы отправки флота
- FIX: Уничтожения лун
- FIX: Фиксы во вкладке "Альянс"
- FIX: Удаление лун
- FIX: Удаление неактивных игроков из бан листа
- FIX: Исправлена работа очереди постройки
- FIX: Ошибка JavaScript в очереди постройки
- FIX: Постройка межпланетных ракет больше вместимости
- FIX: Постройка куполов больше одного
- FIX: Оптимизация меню Постройки
- FIX: Показ межпланетной атаки в обзоре
- FIX: Время отзыва с удержания (экспедиции)
- FIX: Дальность отправки межпланетных ракет
- FIX: Совместная оборона
- FIX: Исправление уязвимостей в меню "Галактика"
- FIX: Исправление уязвимостей в меню "Альянс"
- FIX: Автообновление ресурсов при недостатке энергии
- FIX: Исправление в расчётах в меню Сырьё
- FIX: Полоска застройки планеты в обзоре
- DEL: Бегемот
- DEL: Тёмная материя
- DEL: Система офицеров
- DEL: Убран торговец',

'<font color="lime">0.4 beta 5</font>' => 'Made by AlexPro
- MOD: Совместная оборона
- FIX: Броня кораблей не восстанавливается после каждого раунда
- FIX: Изменения в боевых расчётах
- FIX: Возможность отправить любой корабль на удержание
- FIX: На удержание тратится дейтерий',

'<font color="lime">0.4 beta 4</font>' => 'Made by AlexPro
- MOD: Маленькие изменения в вкладке "Флот"
- MOD: Альянс чат',

'<font color="lime">0.4 beta 3</font>' => 'Made by AlexPro
- MOD: Меню "Скрипты"
- MOD: Счётчик боев
- FIX: Удаление брошенной планеты',

'<font color="lime">0.4 beta 2</font>' => 'Made by AlexPro
- MOD: Новый корабль "Передвижная база"
- MOD: Возможность создания временной планеты-базы
- FIX: Маленькая оптимизация и мелкий багфикс',

'<font color="lime">0.4 beta 1</font>' => 'Made by AlexPro
- MOD: Новая постройка: "Квантово-ионный преоброзователь"
- MOD: Новая постройка: "Гравитационное хранилище"
- MOD: Новое исследование: "Военная база"
- FIX: Ошибка МИС
- FIX: Отображение потребления/производства энергии в инфе о постройке',

'<font color="lime">0.3 beta 6</font>' => 'Made by AlexPro
- FIX: Несколько исправлений в движке полётов
- FIX: Поля на луне
- FIX: Ошибки ракетной атаки',

'<font color="lime">0.3 beta 5</font>' => 'Made by AlexPro
- MOD: Визуальное пополнение ресурсов
- FIX: Оптимизация движка полётов
- MOD: Начало ввода нового ресурса и новой ветки развития империи',

'<font color="lime">0.3 beta 4</font>' => 'Made by AlexPro
- FIX: МИС
- MOD: В шпионском отчёте можно увидеть офицеров
- FIX: Исправления в движке полётов
- FIX: Новая формула начисления боевого опыта',

'<font color="lime">0.3 beta 3</font>' => 'Made by AlexPro
- FIX: Клонирование шпионских зондов
- FIX: Режим отпуска (аналог OGame)',

'<font color="lime">0.3 beta 2</font>' => 'Made by AlexPro
- FIX: Исправлена работа сенсорной фаланги
- FIX: Маленькие исправления в боевой системе
- FIX: Можно нападать на неактивных игроков даже если они под действием защиты новичков
- FIX: Исправления в шпионаже (обзор летящего вражеского флота)
- FIX: Мелкий багфикс',

'<font color="lime">0.3 beta 1</font>' => 'Made by AlexPro
- FIX: Масштабная оптимизация игрового кода
- FIX: Сведено к минимуму клонирование флота
- FIX: Автовход
- FIX: Рабочий офицер "Бункер" (увеличивает очередь постройки)',

'<font color="lime">0.2 beta 4</font>' => 'Made by AlexPro
- DEL: Убран чат
- FIX: Оптимизирована статистика',

'<font color="lime">0.2 beta 3</font>' => 'Made by AlexPro
- FIX: Исправлено удаление неактивных игроков
- FIX: Исправлено множество серьёзных ошибок в выработке ресурсов
- FIX: Полностью рабочее меню "Сырьё"
- FIX: Пересмотрена вместимость хранилищ
- FIX: Косметические изменения
- FIX: В режиме отпуска не добываются ресурсы
- FIX: Выключено кэширование браузером страниц
- FIX: Работает офицер "Генерал"',

'<font color="lime">0.2 beta 2</font>' => 'Made by AlexPro
- MOD: XNova SIM 0.2 RC2
- FIX: Обновлён движок боёв
- FIX: Мсправления в удержании флота (пока флот в удержании в боях не принимает участие)',

'<font color="lime">0.2 beta 1</font>' => 'Made by AlexPro
- MOD: XNova SIM 0.2 RC1
- FIX: Исправлена ошибка БД в сообщениях
- FIX: Обновлён движок боёв
- FIX: Исправлена работа некоторых офицеров
- FIX: Исправление маленьких уязвимостей
- FIX: Исправления в защите новичков
- MOD: Работает боевой опыт
- FIX: Исправления в колонизации
- FIX: Блок на время',

'<font color="lime">0.1 beta 5</font>' => 'Made by AlexPro
- MOD: XNova SIM 0.1 beta',

'<font color="lime">0.1 beta 4</font>' => 'Made by AlexPro
- FIX: Исправлена ошибка COOKIES, приводившая к сбоям игры
- FIX: Маленькая оптимизация
- FIX: Исправлено неправильное отображение времени
- MOD: BB коды в описании альянса
- FIX: Исправления в безопасности
- FIX: Исправления в шпионаже
- ADD: Добавления в чат
- DEL: Убран запуск шпионских зондов и переработчиков через меню "Галактика"
- FIX: Исправлено отображение легенды в меню "Галактика"',

'<font color="lime">0.1 beta 3</font>' => 'Made by AlexPro
- FIX: Исправлена работа ракетной атаки',

'<font color="lime">0.1 beta 2</font>' => 'Made by AlexPro
- MOD: Доделан перевод
- FIX: Оптимизация просмотра галактики
- FIX: Обновлён движок боёв
- FIX: Оптимизация некоторых функций игры
- FIX: Исправления в колонизации
- FIX: Исправления во вкладке Сырьё
- FIX: Исправления в просмотре галактики
- FIX: Исправления в статистике',

'<font color="lime">0.1 beta 1</font>' => 'Made by AlexPro
- MOD: Перевод на русский язык (by AlexPro)
- MOD: Баг репорт (прямая связь)
- FIX: Просмотр планет в галактике
- FIX: Исправлена работа большого купола
- FIX: Исправлена работа в браузере Opera
- FIX: Исправлена прокрутка левого фрейма
- FIX: Исправлена стили скина
- DIV: Base of XNova 0.8a',

);

return $lang;