<?php

return [
	'NoPoints' => 'У вас недостаточно кредитов!',
	'OffiRecrute' => 'Офицер был завербован!',
	'off_points' => 'Доступно кредитов : ',
	'Officier' => 'Офицер',
	'power' => [
		601 => [
			'+25% доход от шахт',
			'+25% вместимость хранилищ',
		],
		602 => [
			'+2 макс. кол-во флотов',
			'+10% к макс. шансу возникновения луны',
			'+25% к скорости кораблей',
			'-10% затраты на строительство кораблей',
		],
		603 => [
			'+15% выработка энергии',
			'-10% затраты на строительство обороны',
			'-30% потери при обороне',
			'-50% шанс взрыва ЗС',
		],
		604 => [
			'+2 к уровню шпионажа',
			'-25% времени на исследования',
		],
		605 => [
			'+2 к очереди построек',
			'-25% времени на постройку',
		],
		606 => [
			'-20% потребление дейтерия в полёте',
		],
		607 => [
			'+10% Вооружение',
			'+10% Щиты',
			'+10% Броня',
		],
	],
];