<?php

return [
	'NoPoints' => 'У вас недостаточно кредитов!',
	'OffiRecrute' => 'Офицер был завербован!',
	'off_points' => 'Доступно кредитов : ',
	'Officier' => 'Офицер',
	'items' => [
		'geologist' => 'Геолог',
		'admiral' => 'Адмирал',
		'engineer' => 'Инженер',
		'technocrat' => 'Технократ',
		'architect' => 'Архитектор',
		'metaphysician' => 'Метафизик',
		'mercenary' => 'Наёмник',
	],
	'description' => [
		'geologist' => 'Геолог - это признанный эксперт в астроминералогии и кристаллографии. Он со своей командой металлургов и химиков он поддерживает межпланетные правительства при разработке новых источников ресурсов и оптимизации их очистки.',
		'admiral' => 'Адмирал - это испытанный войной ветеран и гениальный стратег. Даже в самых горячих боях он не теряет обзора и поддерживает контакт с подчинёнными ему адмиралами. Мудрый правитель может полностью положиться на него в бою и тем самым использовать для боя больше кораблей.',
		'engineer' => 'Инженер - это специалист по управлению энергией. В мирное время он повышает уровень энергетических сетей на колониях. В случае нападения он снабжает энергетические системы планетарных защит и предотвращает перегрузки, что ведёт к значительно меньшей степени потерь в бою.',
		'technocrat' => 'Гильдия технократов - это гениальные учёные, и их всегда можно найти там, где заканчивается грань технически возможного. Их код никогда не сможет разгадать ни один нормальный человек, и одним своим присутствием они вдохновляют учёных империи.',
		'architect' => 'Архитектор - это незаменимый специалист в любом строительстве. Благодаря исследованиям и экспериментам, связанным с проектным решением, авторскому надзору за строительством и научному подходу, позволяет ускорить строительство и увеличить КПД строителей.',
		'metaphysician' => 'Метафизик - это высококласный специалист в лунном деле. Благодаря своим знаниям он может усиливать гравитационную пушку Звезды Смерти, что позволяет эффективнее применять её в уничтожении лун.',
		'mercenary' => 'Наёмник - высококласный специалист в военном деле. Нанятый к вам на службу, он помогает увеличить эффективность вашего вооружения.',
	],
	'power' => [
		'geologist' => [
			'+25% доход от шахт',
			'+25% вместимость хранилищ',
		],
		'admiral' => [
			'+2 макс. кол-во флотов',
			'+10% к макс. шансу возникновения луны',
			'+25% к скорости кораблей',
			'-10% затраты на строительство кораблей',
		],
		'engineer' => [
			'+15% выработка энергии',
			'-10% затраты на строительство обороны',
			'-30% потери при обороне',
			'-50% шанс взрыва ЗС',
		],
		'technocrat' => [
			'+2 к уровню шпионажа',
			'-25% времени на исследования',
		],
		'architect' => [
			'+2 к очереди построек',
			'-25% времени на постройку',
		],
		'metaphysician' => [
			'-20% потребление дейтерия в полёте',
		],
		'mercenary' => [
			'+10% Вооружение',
			'+10% Щиты',
			'+10% Броня',
		],
	],
];
