<?php

$lang['NoPoints']     = "У вас недостаточно кредитов!";
$lang['OffiRecrute']  = "Офицер был завербован!";
$lang['off_points']   = "Доступно кредитов : ";
$lang['Officier']     = "Офицер";

$lang['power'][601] = [
	'+25% доход от шахт',
	'+25% вместимость хранилищ'
];

$lang['power'][602] = [
	'+2 макс. кол-во флотов',
	'+10% к макс. шансу возникновения луны',
	'+25% к скорости кораблей',
	'-10% затраты на строительство кораблей'
];

$lang['power'][603] = [
	'+15% выработка энергии',
	'-10% затраты на строительство обороны',
	'-30% потери при обороне',
	'-50% шанс взрыва ЗС'
];

$lang['power'][604] = [
	'+2 к уровню шпионажа',
	'-25% времени на исследования'
];

$lang['power'][605] = [
	'+2 к очереди построек',
	'-25% времени на постройку'
];

$lang['power'][606] = [
	'-20% потребление дейтерия в полёте'
];

$lang['power'][607] = [
	'+10% Вооружение',
	'+10% Щиты',
	'+10% Броня'
];

return $lang;