<?php

return [
	'registry' => 'Регистрация',
	'form' => 'Форма регистрации',
	'Register' => 'XNova Регистрация',
	'Undefined' => 'Не указано',
	'Male' => 'Мужской',
	'Female' => 'Женский',
	'Multiverse' => '<b>XNova</b> UfaNet',
	'E-Mail' => 'E-Mail Адрес (прим. addy@mail.com)',
	'MainPlanet' => 'Название главной планеты',
	'GameName' => 'Логин',
	'Sex' => 'Пол',
	'signup' => 'Регистрация',
	'neededpass' => 'Пароль',
	'Languese' => 'Язык',
	'ru' => 'Русский',

	'mail_welcome' => '
Спасибо за регистрацию в игре XNova Game
Ваш пароль от аккаунта : {password}
Запомните его!!!

С уважением администрация {gameurl}. На это сообщение отвечать не нужно.',

	'mail_title' => 'Регистрация в игре XNova (xnova.su)',
	'thanksforregistry' => '<a href="/">На главную...</a><br /><br />Спасибо за регистрацию.<br />Копия пароля выслана вам на E-mail адрес',

	'error_mail' => 'Неверный E-Mail!',
	'error_character' => 'Неверное имя.<br />',
	'error_charalpha' => 'Вы можете использовать только латинские буквы и цифры!<br />',
	'error_lang' => 'Неверно указан язык игры.<br />',
	'error_password' => 'Пароль должен состоять как минимум из 4 знаков!',
	'error_confirm' => 'Пароли должны быть одинаковыми',
	'error_rgt' => 'Вы должны согласиться с правилами!',
	'error_userexist' => 'Такое имя уже используется!<br />',
	'error_emailexist' => 'Такой e-mail уже используется!',
	'error_sex' => 'Ошибка в выборе пола!<br />',
	'error_mailsend' => 'Ошибка в отправлении электронной почти, ваш пароль: ',
	'reg_welldone' => 'Регистрация завершена!',
];
